[
    {
        "organisation": "FUTY",
        "organisationLink": "https://www.linkedin.com/company/futyyyuk/posts/?feedView=all",
        "location": "London, United Kingdom",
        "position": "Frontend Developer",
        "isNPO": false,
        "description": [
            "Contributed to the development of a seamless and high-performance client-side experience for the FUTY fantasy sports platform.",
            "Worked with TypeScript, React, Redux, React Query, and Tailwind CSS to build engaging and responsive user interfaces.",
            "Implemented performance optimizations using memoization, virtualization, hashmaps, and efficient data management with Redux and React Query.",
            "Contributed to enhancing the app performance, improving the user interface to be more interactive and responsive, especially with large datasets."
        ],
        "timeline": "Oct 2024 - Dec 2024",
        "skills": [
            "React.js",
            "Redux",
            "TypeScript",
            "Tailwind CSS",
            "React Query"
        ],
        "projects": []
    },
    {
        "organisation": "Opalina Technologies",
        "organisationLink": "https://www.opalina.in/",
        "location": "Noida, India",
        "position": "Backend Developer",
        "isNPO": false,
        "description": [
            "Contributed in building Loan Origination System & its CMS using Java, Spring Boot & MongoDB from inception stage to DEV & UAT environments.",
            "Developed optimised Restful APIs for LOS & CMS systems with minimal response time using MongoDB aggregation pipelines.",
            "Optimised MongoDB schema and align with evolving software requirements, ensuring data consistency and compatibility.",
            "Configured CronJobs functions for on time notifications in both LOS & CMS systems & configured Spring Security for LOS Applications for safe and secured user authentication & authorization.",
            "Worked closely with team to ensure software requirements, identifying problems, analyzing solutions, debugging issues and on time delivery of features."
        ],
        "timeline": "Nov 23 - May 2024",
        "skills": [
            "Java",
            "Spring Boot",
            "MongoDB",
            "AWS"
        ],
        "projects": []
    }
]